//===========================================================================================================================================================
// 
// カードのステート [card_state.cpp]
// Author : 梅田　爽真
// 
//===========================================================================================================================================================
#include "card_state.h"
#include "card.h"
#include "active_scene_manager.h"
#include "target_arrow.h"

//===========================================================================================================
// 
// カードステート基底クラス
// 
//===========================================================================================================

//=======================================================================================
// 終了処理
//=======================================================================================
void My::CCardState::Uninit()
{
	//delete m_pCardCpy;
	//m_pCardCpy = nullptr;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardState::Copy(CCard* /*cpy*/)
{
	//m_pCardCpy = cpy;
}


//===========================================================================================================
// 
// ニュートラルステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStateNeutral::Init(CCard* cpy, CDuelCharacter* /*duel*/)
{
	if (cpy == nullptr)
		return;

	D3DXVECTOR3 pos = cpy->GetPos();
	D3DXVECTOR3 npos = cpy->GetNeutralPos();

	cpy->SetPos(npos);
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStateNeutral::Update(CCard* cpy, CDuelCharacter* /*duel*/)
{
	if (cpy == nullptr)
		return;

	cpy->SetSize({ 1.0f * 1.2f, 1.0f, 1.0f });
}


//===========================================================================================================
// 
// ピックアップステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStatePickup::Init(CCard* cpy, CDuelCharacter* /*duel*/)
{
	if (cpy == nullptr)
		return;

	// カードを見やすくする
	D3DXVECTOR3 pos = cpy->GetPos();
	//pos.y += 20.0f;
	pos.z += 10.0f;
	cpy->SetPos(pos);
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStatePickup::Update(CCard* cpy, CDuelCharacter* /*duel*/)
{
	if (cpy == nullptr)
		return;

	cpy->SetSize({ 1.5f * 1.2f, 1.5f, 1.5f });

	//cpy->SetSize({ 1.2f * 1.2f,1.2f, 1.2f });
}


//===========================================================================================================
// 
// キャストステート(カードを使用)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateCast::Init(CCard* cpy, CDuelCharacter* /*duel*/)
{
	if (cpy == nullptr)
		return;

	//CActiveSceneManager::GetInstance()->ChangeState(new CCardCast);

	// 今だけわかりやすく位置を変える
	//D3DXVECTOR3 pos = cpy->GetPos();
	//pos.z += 20.0f;

	//cpy->SetPos(pos);
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateCast::Update(CCard* cpy, CDuelCharacter* /*duel*/)
{
	if (cpy == nullptr)
		return;

	//倍率
	float mag = 30.0f;
	cpy->SetSize({ mag * 1.2f,mag,mag });

	//cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY);
}

//===========================================================================================================
// 
// ステイステート(カード効果発動待機)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateStay::Init(CCard* cpy, CDuelCharacter* /*duel*/)
{
	// カウントを初期化
	m_Staycount = 0;

	//リストの取得
	std::list<CActiveSceneCharacter*> List = CActiveSceneManager::GetInstance()->GetCharacterList();

	//キャラクターの周回
	for (auto& iter : List)
	{
		if (cpy->GetUserArea() != iter->GetArea()) continue;

		// ステータスを取得
		CActiveSceneCharacter::Status status = iter->GetStatus();

		// コスト分エナジーを減らす
		status.energy -= cpy->GetBaseStatus().nCost;

		// エナジーを設定
		iter->SetStatus(status);

		// ターゲットアローを生成(昔)
		//cpy->SetTargetArrow(CTargetArrow::Create(cpy->GetUserArea(), cpy->GetTarget()));

		// ターゲットアローをマネージャーに登録
		iter->GetTargetArrowManeger()->Regist(CTargetArrow::Create(CInputMouse::AREA::DOWN, cpy->GetTarget()));

		break;
	}
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateStay::Update(CCard* cpy, CDuelCharacter* duel)
{
	if (cpy == nullptr)
		return;

	//ディフェンスカードはカウントダウンを始めない
	if (cpy->GetBaseStatus().maintype == CCard::TYPE_DEFFENCE) return;

	if (m_Staycount >= STAY_TIME)
	{// カウントが設定された時間を超えたら

		// トリガー状態にする
		cpy->ChangeState(CCardState::CARD_STATE::CARD_TRIGGER, duel);
	}

	// カウントを進める
	m_Staycount++;
}

//===========================================================================================================
// 
// トリガーステート(カード効果発動)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateTrigger::Init(CCard* cpy, CDuelCharacter* duel)
{
	if (cpy == nullptr)
		return;

	//リストの取得
	std::list<CActiveSceneCharacter*> List = CActiveSceneManager::GetInstance()->GetCharacterList();

	//キャラクターの周回
	for (auto& iter : List)
	{
		if (cpy->GetUserArea() != iter->GetArea()) continue;

		//トリガーしたか
		if (CActiveSceneManager::GetInstance()->GetAreaManager()->CardTrigger(cpy->GetTarget()))
		{
			//トリガー処理
			cpy->GetCardStrategy()->Strategy(duel, cpy);
		}

		// トリガーされた際に消去する(TODO : 使用者によって変更)
		iter->GetTargetArrowManeger()->Remove();

		break;
	}
}
