//===========================================================================================================================================================
// 
// card_frame_use_font.cpp [card_frame_use_font.cpp]
// Author : matsuda towa
// 
//===========================================================================================================================================================
#include "card_frame_use_font.h"

//===========================================================================================================================================================
// コンストラクタ
//===========================================================================================================================================================
My::CCardFrameUseFont::CCardFrameUseFont(int nPriority):CCardFrame(nPriority),
m_pFontManager(nullptr),
m_offsetpos(VEC3_RESET_ZERO)
{
}

//===========================================================================================================================================================
// デストラクタ
//===========================================================================================================================================================
My::CCardFrameUseFont::~CCardFrameUseFont()
{
	if (m_pFontManager != nullptr)
	{
		m_pFontManager->Uninit();
		delete m_pFontManager;
		m_pFontManager = nullptr;
	}
}

//===========================================================================================================================================================
// 初期化
//===========================================================================================================================================================
HRESULT My::CCardFrameUseFont::Init()
{
	CCardFrame::Init();
	if (m_pFontManager == nullptr)
	{
		m_pFontManager = new CFontManager;
		m_pFontManager->Init();
	}
	return S_OK;
}

//===========================================================================================================================================================
// 終了
//===========================================================================================================================================================
void My::CCardFrameUseFont::Uninit()
{
	CCardFrame::Uninit();
}

//===========================================================================================================================================================
// 更新
//===========================================================================================================================================================
void My::CCardFrameUseFont::Update()
{
	CCardFrame::Update();

	if (m_pFontManager != nullptr)
	{
		std::vector<CFont*> list = m_pFontManager->GetList();
		D3DXVECTOR3 screen_pos = ConvertToScreenPos(GET_CAMERA(GET_CAMERA_IDX), GetPos()); //スクリーン座標に変換
		float text_shift = (float)m_pFontManager->GetTextShift();

		screen_pos.x += m_offsetpos.x;
		screen_pos.y += m_offsetpos.y;
		int i = INT_ZERO;
		for (auto& itr : list)
		{
			if (itr == nullptr) { continue; }
			screen_pos.x += text_shift;
			itr->SetPos(screen_pos);
			// 山札時はコストを表示しないように TODO:今後はここの条件式を見直す必要あり
			if (GetCard()->GetCurrentZone() != CCard::DECK)
			{
				itr->SetisDraw(true);
			}
			else if (GetCard()->GetCurrentZone() == CCard::DECK)
			{
				itr->SetisDraw(false);
			}
			++i;
		}
	}
}
