//===========================================================================================================================================================
// 
// アタックカード [card_attack.h]
// Author : 梅田　爽真
// 
//===========================================================================================================================================================
#ifndef _CARD_ATK_H_
#define _CARD_ATK_H_
#include "main.h"
#include "card.h"

namespace My
{
	class CCardAttack :public CCard
	{
		/**
		 * @brief コンストラクタ
		 */
		CCardAttack();

		/**
		 * @brief デストラクタ
		 */
		~CCardAttack()override;
	};
}

#endif // !_CARD_ATK_H_