//===========================================================================================================================================================
// 
// card_frame_type.cppのヘッダー [card_frame_type.h]
// Author : souma umeda
// 
//===========================================================================================================================================================
#include "card_frame_type.h"

namespace
{
	const D3DXVECTOR2 OFFSET = { 35.0f,-65.0f };
}

//===========================================================================================================================================================
// コンストラクタ
//===========================================================================================================================================================
My::CCardFrameType::CCardFrameType(int nPriority):CCardFrame(nPriority),
m_pTypeicon(nullptr)
{
}

//===========================================================================================================================================================
// 初期化
//===========================================================================================================================================================
HRESULT My::CCardFrameType::Init()
{
	D3DXVECTOR3 icon_pos = GetPos();
	icon_pos.x += OFFSET.x;
	icon_pos.y += OFFSET.y;
	if (m_pTypeicon == nullptr)
	{
		m_pTypeicon = CCardTypeIcon::Create(icon_pos, GetCard()->GetCardType());
	}
	CCardFrame::Init();

	return S_OK;
}

//===========================================================================================================================================================
// 終了
//===========================================================================================================================================================
void My::CCardFrameType::Uninit()
{
	if (m_pTypeicon != nullptr)
	{
		m_pTypeicon->SetisDelete(true);
		m_pTypeicon = nullptr;
	}
	CCardFrame::Uninit();
}

//===========================================================================================================================================================
// 更新
//===========================================================================================================================================================
void My::CCardFrameType::Update()
{
	CCardFrame::Update();
	CCard::ZONE current_zone = GetCard()->GetCurrentZone();
	// 山札時はコストを表示しないように TODO:今後はここの条件式を見直す必要あり
	if (current_zone == CCard::DECK || current_zone == CCard::CEMETERY)
	{
		m_pTypeicon->SetisDraw(false);
		return;
	}
	
	m_pTypeicon->SetisDraw(GetisDraw());

	D3DXVECTOR3 icon_pos = GetPos();
	icon_pos.x += OFFSET.x;
	icon_pos.y += OFFSET.y;

	if (m_pTypeicon != nullptr)
	{
		m_pTypeicon->SetPos(icon_pos);
	}
}
