//=============================================
//
//カード情報の背景[card_info_BG.cpp]
//Author Matsuda Towa
//
//=============================================
#include "card_info_BG.h"
#include "card_info_base.h"

//=============================================
// コンストラクタ
//=============================================
My::CCardInfoBG::CCardInfoBG(int nPriority):CCardInfoBase(nPriority)
{
}

//=============================================
// デストラクタ
//=============================================
My::CCardInfoBG::~CCardInfoBG()
{
}

//=============================================
// 初期化
//=============================================
HRESULT My::CCardInfoBG::Init()
{
	SetColor({COLOR_BLACK.r, COLOR_BLACK.g, COLOR_BLACK.b, 0.8f});
	return S_OK;
}

//=============================================
//　終了
//=============================================
void My::CCardInfoBG::Uninit()
{
	CObject2D::Uninit();
}

//=============================================
// 更新
//=============================================
void My::CCardInfoBG::Update()
{
	SetVtx();
}

//=============================================
// 描画
//=============================================
void My::CCardInfoBG::Draw()
{
	CObject2D::Draw();
}
