//===========================================================================================================================================================
// 
// アシストカード [card_assist.h]
// Author : 梅田　爽真
// 
//===========================================================================================================================================================
#ifndef _CARD_AST_H_
#define _CARD_AST_H_
#include "main.h"
#include "card.h"

namespace My
{
	class CCardAssist :public CCard
	{
		/**
		 * @brief コンストラクタ
		 */
		CCardAssist();

		/**
		 * @brief デストラクタ
		 */
		~CCardAssist()override;
	};
}

#endif // !_CARD_AST_H_