//===========================================================================================================================================================
// 
// カードのステート [card_state.cpp]
// Author : 梅田　爽真
// 
//===========================================================================================================================================================
#include "card_state.h"
#include "card.h"
#include "game_manager.h"

//===========================================================================================================
// 
// カードステート基底クラス
// 
//===========================================================================================================

//=======================================================================================
// 終了処理
//=======================================================================================
void My::CCardState::Uninit()
{
	//delete m_pCardCpy;
	//m_pCardCpy = nullptr;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardState::Copy(CCard* cpy)
{
	//m_pCardCpy = cpy;
}


//===========================================================================================================
// 
// ニュートラルステート
// 
//===========================================================================================================

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStateNeutral::Update(CCard* cpy)
{
	if (cpy == nullptr)
		return;

	cpy->SetScale({ 0.8f * 1.2f, 0.8f, 0.8f });
}


//===========================================================================================================
// 
// ピックアップステート
// 
//===========================================================================================================

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStatePickup::Update(CCard* cpy)
{
	if (cpy == nullptr)
		return;

	cpy->SetScale({ 1.2f,1.0f, 1.0f });
}


//===========================================================================================================
// 
// ピックアップステート
// 
//===========================================================================================================

void My::CCardStateCast::Init(CCard* cpy)
{
	if (cpy == nullptr)
		return;

	// 今だけわかりやすく位置を変える
	D3DXVECTOR3 pos = cpy->GetPos();
	pos.z += 20.0f;

	cpy->SetPos(pos);

	// ゲームのステートをキャスト状態に変える
	CGameManager::GetInstance()->ChangeState(new CCardCast());	
}

void My::CCardStateCast::Update(CCard* cpy)
{
	// キーボードを取得
	CInputKeyboard* pKeyboard = CManager::GetInstance()->GetKeyboard();
	bool IsSelectPlayer = false;	// プレイヤーを選択した

	// TODO : 一旦ここで判別をしている
	if (pKeyboard->GetTrigger(DIK_1))
	{
		IsSelectPlayer = true;
	}
	if (pKeyboard->GetTrigger(DIK_2))
	{
		IsSelectPlayer = true;
	}
	if (pKeyboard->GetTrigger(DIK_3))
	{
		IsSelectPlayer = true;
	}

	if(IsSelectPlayer)
		cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY);
}

void My::CCardStateStay::Init()
{
	// カウントを初期化
	m_Staycount = 0;
}

void My::CCardStateStay::Update(CCard* cpy)
{
	if (cpy == nullptr)
		return;

	if (m_Staycount >= STAY_TIME)
	{
		cpy->ChangeState(CCardState::CARD_STATE::CARD_PLAY);
	}

	m_Staycount++;
}

void My::CCardStatePlay::Init(CCard* cpy)
{
	if (cpy == nullptr)
		return;

	D3DXVECTOR3 pos = cpy->GetPos();
	pos.x += 20.0f;

	cpy->SetPos(pos);
}
