//===========================================================================================================================================================
// 
// アタックカードの処理 [card_attack.cpp]
// Author : 島津　湧人
// 
//===========================================================================================================================================================
#include "card_attack.h"
#include "active_scene_manager.h"
#include "raknet.h"
#include "zone_manager.h"

My::CCardAttack::CCardAttack(int nPriority):CCard(nPriority),
m_AttackType(),
m_nAttackValue(INT_ZERO)
{
}

My::CCardAttack::~CCardAttack()
{
}

//===========================================================================================================
// 初期化処理
//===========================================================================================================
HRESULT My::CCardAttack::Init()
{
	SetCardType(CCard::CARDTYPE_::TYPE_ATTACK);
	CCard::Init();

	//トリガー時のストラテジーを代入
	SetCardStrategy(new CAttack);
	return S_OK;
}

//===========================================================================================================
// 終了処理
//===========================================================================================================
void My::CCardAttack::Uninit()
{
	CCard::Uninit();
}

//===========================================================================================================
// 更新処理
//===========================================================================================================
void My::CCardAttack::Update()
{
	CCard::Update();
}

//===========================================================================================================
// 描画処理
//===========================================================================================================
void My::CCardAttack::Draw()
{
	CCard::Draw();
}

//===========================================================================================================
// カード情報読み込み
//===========================================================================================================
void My::CCardAttack::LoadCardData()
{
	//TODO:各ステータス読み込みしてから親クラスの読み込み
	CCard::LoadCardData();
}

//===========================================================================================================
//固有情報の読み込み
//===========================================================================================================
void My::CCardAttack::LoadUniqueInfo(CCard_Client::Param param)
{
	//攻撃ステータスの読み込み
	m_AttackType = (AttackType)param.Attacktype;	//攻撃の種類
	m_nAttackValue = param.nDamage;					//攻撃力
}

//===========================================================================================================
//キャストをしたかの確認
//===========================================================================================================
bool My::CCardAttack::IsCast(CDuelCharacter* duel)
{
	//キャラクターリスト
	for (auto& iter : CActiveSceneManager::GetInstance()->GetCharacterList())
	{
		//対象のエリアを持つプレイヤーを探す
		if (GetTarget() != iter->GetArea()) continue;

		return true;
	}

	return false;
}

//===========================================================================================================
//キャスト処理
//===========================================================================================================
void My::CCardAttack::Cast(CDuelCharacter* duel)
{
	//キャラクターの取得
	for (auto& iter : CActiveSceneManager::GetInstance()->GetCharacterList())
	{
		//対象のエリアを持つプレイヤーを探す
		if (GetTarget() != iter->GetArea()) continue;
		
		//デュエル状態にキャスト
		//if (typeid(CDuelCharacter) != typeid(*iter->GetState())) break;					//状態の確認
		CDuelCharacter* DuelState = dynamic_cast<CDuelCharacter*>(iter->GetState());	//キャスト
		if (DuelState == nullptr) break;												//中身の確認

		//待機状態のカードを確認
		if (!DuelState->GetZoneManager()->GetWaitZone()->GetList().empty())
		{
			CCard* pCard = DuelState->GetZoneManager()->GetWaitZone()->GetList().front();	//先頭のカードの確認
			if (pCard == nullptr) break;

			//守備カードに自身のエリアを追加し、ステイ状態にする
			pCard->SetTarget(GetUserArea());
			pCard->ChangeState(CCardState::CARD_STAY, duel);
		}

		break;
	}
	
}

//===========================================================================================================
//トリガー処理
//===========================================================================================================
void My::CCardAttack::Trigger()
{
	//ステイ後に起動
}