//===========================================================================================================================================================
// 
// 墓地ゾーンの処理 [cemetery_zone.cpp]
// Author : Kasai Keisuke
// 
//===========================================================================================================================================================

// include
#include "cemetery_zone.h"

/**
* @brief コンストラクタ
*/
My::CCemetery::CCemetery()
{

}

/**
* @brief デストラクタ
*/
My::CCemetery::~CCemetery()
{

}

/**
* @brief 墓地に送る
*/
void My::CCemetery::SendToGrave(CCard* pCard)
{
	// 追加処理
	AddCard(pCard);
}
