//================================
//
// Client用のcpp[client.cpp]
// Author:Yuuto Shimadu
//
//================================

//ヘッダーのインクルード
#include "client.h"
#include "game_player.h"
#include "enemy.h"
#include "active_scene_manager.h"
#include "raknet.h"

//=====================================
//コンストラクタ
//=====================================
CClient::CClient()// :
 //   m_PlayerParamList()	//リスト
{

}

//=====================================
//デストラクタ
//=====================================
CClient::~CClient()
{

}

//=====================================
//初期化処理
//=====================================
bool CClient::Init()
{
    return true;
}

//=====================================
//終了処理
//=====================================
void CClient::Uninit()
{

}

//=====================================
//登録処理
//=====================================
void CClient::Regist(RakNet::Packet* /*packet*/)
{
   
}

//=====================================
//敵を生成するか
//=====================================
bool CClient::CheckEnemyCreate(int /*id*/, int /*max*/)
{
    return true;
}

//=====================================
//削除処理
//=====================================
void CClient::Delete(RakNet::Packet* /*packet*/)
{
   
}

//=====================================
//準備完了送信処理
//=====================================
void CClient::SendReady(RakNet::Packet* /*packet*/, RakNet::RakPeerInterface* /*peer*/)
{
    
}

//=====================================
//準備完了受信処理
//=====================================
void CClient::ReceiveReady(RakNet::Packet* /*packet*/)
{
    
}

//=====================================
//カードキャスト処理
//=====================================
void CClient::CardCast(RakNet::Packet* /*packet*/)
{
   
}
