//=============================================
//
//カウントダウン表示UI[countdown_UI.cpp]
//Author Matsuda Towa
//
//=============================================

//インクルード
#include "countdown_UI.h"
#include "duel_manager.h"

//=============================================
// コンストラクタ
//=============================================
My::CCountdownUI::CCountdownUI(int nPriority) :CObject2D(nPriority),
m_fLife(1.0f)
{
}

//=============================================
// デストラクタ
//=============================================
My::CCountdownUI::~CCountdownUI()
{
}

//=============================================
// 初期化
//=============================================
HRESULT My::CCountdownUI::Init()
{
	return S_OK;
}

//=============================================
// 終了
//=============================================
void My::CCountdownUI::Uninit()
{
	CObject2D::Uninit();
}

//=============================================
// 更新
//=============================================
void My::CCountdownUI::Update()
{
	//頂点設定
	CObject2D::Update();

	//寿命を進める
	m_fLife -= My::CDuel_Manager::GetInstance()->GetDuelTimer().GetdeltaTime();

	//0以下なら破棄
	if (m_fLife <= 0.0f)
	{
		Uninit();
	}
}

//=============================================
// 描画
//=============================================
void My::CCountdownUI::Draw()
{
	//親の描画
	CObject2D::Draw();
}