//=============================================
//
//コンピューター[cpu.cpp]
//Author Matsuda Towa
//
//=============================================
#include "cpu.h"

//=============================================
// コンストラクタ
//=============================================
My::CCpu::CCpu(int nPriority)
{
	//TAGの変更
	My::CCharacter::SetTag(My::CCharacter::TAG_CPU);
}

//=============================================
// デストラクタ
//=============================================
My::CCpu::~CCpu()
{
	
}

//=============================================
// 初期化
//=============================================
HRESULT My::CCpu::Init()
{
	CEnemy::Init();
	return S_OK;
}

//=============================================
// 終了
//=============================================
void My::CCpu::Uninit()
{
	//親クラスの終了処理を呼ぶ
	CEnemy::Uninit();
}

//=============================================
// 更新
//=============================================
void My::CCpu::Update()
{
	CEnemy::Update();
}

//=============================================
// 描画
//=============================================
void My::CCpu::Draw()
{
	//親クラスのモーション用の描画を呼ぶ
	MotionDraw();
}

//=============================================
// 生成
//=============================================
My::CEnemy* My::CCpu::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int id)
{
	CCpu* pCpu = new CCpu;
	if (pCpu == nullptr) { return nullptr; }
	pCpu->SetPos(pos);
	pCpu->SetRot(rot);
	pCpu->SetPlayerIdx(id);
	pCpu->Init();
	return pCpu;
}
