//===========================================================================================================================================================
// 
// 手札のヘッダー [hand.h]
// Author : souma umeda
// 
//===========================================================================================================================================================
#ifndef _HAND_H_
#define _HAND_H_
#include "main.h"

namespace My
{
	/**
	* @brief 手札のクラス
	*/
	class CHand
	{
	public:
		/**
		* @brief 初期化
		*/
		void Init();

		/**
		* @brief 開始時
		*/
		void Start();

		/**
		* @brief 選択
		*/
		void Select();

		/**
		* @brief 手札を引く
		* @param [in]ドロー数
		*/
		void HandDraw(int drawnum);



	private:

	};
}

#endif // !HAND_H_