//===========================================================================================================================================================
// 
// カードのステート [card_state.cpp]
// Author : 梅田　爽真
// 
//===========================================================================================================================================================
#include "card_state.h"
#include "card.h"
#include "zone_manager.h"

//===========================================================================================================
// 
// カードステート基底クラス
// 
//===========================================================================================================

//=======================================================================================
// 終了処理
//=======================================================================================
void My::CCardState::Uninit()
{
	//delete m_pCardCpy;
	//m_pCardCpy = nullptr;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardState::Copy(CCard* /*cpy*/)
{
	//m_pCardCpy = cpy;
}


//===========================================================================================================
// 
// ニュートラルステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStateNeutral::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStateNeutral::Update(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}


//===========================================================================================================
// 
// ピックアップステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStatePickup::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStatePickup::Update(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//===========================================================================================================
// 
// 選択ステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStateSelect::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStateSelect::Update(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}


//===========================================================================================================
// 
// キャストステート(カードを使用)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateCast::Init(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	////リストの取得
	//std::list<CActiveSceneCharacter*> List = CActiveSceneManager::GetInstance()->GetCharacterList();

	////キャラクターの周回
	//for (auto& iter : List)
	//{
	//	if (cpy->GetUserArea() != iter->GetArea()) continue;

	//	// ステータスを取得
	//	CActiveSceneCharacter::Status status = iter->GetStatus();

	//	// コスト分エナジーを減らす
	//	status.energy -= cpy->GetBaseStatus().nCost;

	//	// エナジーを設定
	//	iter->SetStatus(status);

	//	break;
	//}

	////カードのキャスト処理
	//cpy->Cast(duel);
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateCast::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	//状態を変更
	ChangeToState(cpy, duel);

	//cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY, duel);

	//cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY);
}

//=======================================================================================
// 状態を変更
//=======================================================================================
void My::CCardStateCast::ChangeToState(CCard* cpy, CDuel_Player* duel)
{
	////守備カードじゃないならステイ状態
	//if (cpy->GetBaseStatus().maintype != CCard::CARDTYPE_::TYPE_DEFFENCE)
	//{
	//	cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY, duel);
	//	return;
	//}

	////ターゲットが自分なら守備待機状態へ
	//if (cpy->GetTarget() == cpy->GetUserArea())
	//{
	//	cpy->ChangeState(CCardState::CARD_STATE::CARD_WAIT, duel);
	//	return;
	//}

	////ターゲットが敵ならステイ状態へ
	//cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY, duel);
}

//===========================================================================================================
// 
// ステイステート(カード効果発動待機)
// 
//===========================================================================================================

//=======================================================================================
//コンストラクタ
//=======================================================================================
My::CCardStateStay::CCardStateStay() : 
	m_dCount()	//カウント
{
	
}

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateStay::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	// カウントを初期化
	m_Staycount = 0;

	//cpy->Stay();
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateStay::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	////倍率
	//float mag = 5.0f;
	//cpy->SetSize({ mag * 1.2f,mag,mag });

	////ディフェンスカードはカウントダウンを始めない
	//if (cpy->GetBaseStatus().maintype == CCard::TYPE_DEFFENCE) return;

	//if (m_Staycount >= STAY_TIME)
	//{// カウントが設定された時間を超えたら

	//	//オブジェクトの破棄
	//	if (m_pNumber != nullptr)
	//	{
	//		m_pNumber->Uninit();
	//		m_pNumber = nullptr;
	//	}

	//	// トリガー状態にする
	//	cpy->ChangeState(CCardState::CARD_STATE::CARD_TRIGGER, duel);
	//	
	//	return;
	//}

	//// カウントを進める
	//m_Staycount++;

	////カウントダウン処理
	//CountDown();
}

//=======================================================================================
// カウントダウン処理
//=======================================================================================
void My::CCardStateStay::CountDown()
{
	//++m_nCount;

	////数字の表記
	//if (m_nCount > 60)
	//{
	//	//数値のリセット
	//	m_nCount = 0;

	//	//描画する数値を減らす
	//	--m_nDrawNum;

	//	//数字の設定
	//	m_pNumber->SetNumber(m_nDrawNum * 0.1f, (m_nDrawNum + 1) * 0.1f, COLOR_WHITE);
	//}
}

//===========================================================================================================
// 
// 守備ステイステート(守備カード効果発動待機)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateWait::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateWait::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;
}

//===========================================================================================================
// 
// トリガーステート(カード効果発動)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateTrigger::Init(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	////リストの取得
	//std::list<CActiveSceneCharacter*> List = CActiveSceneManager::GetInstance()->GetCharacterList();

	////キャラクターの周回
	//for (auto& iter : List)
	//{
	//	if (cpy->GetUserArea() != iter->GetArea()) continue;

	//	//トリガーしたか
	//	if (CActiveSceneManager::GetInstance()->GetAreaManager()->CardTrigger(cpy->GetTarget()))
	//	{
	//		//トリガー処理
	//		//cpy->GetCardStrategy()->Strategy(duel, cpy);

	//		//TODO:一旦計算後のストラテジーベクターだけ処理
	//		std::vector<CCardStrategy_Base*> strategy_vector = cpy->GetPostCalculateVector();

	//		for (auto& itr : strategy_vector)
	//		{
	//			if (itr == nullptr) { continue; }
	//			itr->Strategy(duel, cpy);
	//		}
	//	}

	//	//// トリガーされた際に消去する(TODO : 使用者によって変更)
	//	//iter->GetTargetArrowManeger()->Remove();

	//	break;
	//}
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateTrigger::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;
}