//===========================================================================================================================================================
// 
// カードのステート [card_state.cpp]
// Author : 梅田　爽真
// 
//===========================================================================================================================================================
#include "card_state.h"
#include "card.h"
#include "zone_manager.h"
#include "GetTime.h"
#include "duel_manager.h"
#include "duel_player_manager.h"
#include "card_strategy.h"

//===========================================================================================================
// 
// カードステート基底クラス
// 
//===========================================================================================================

//=======================================================================================
// 終了処理
//=======================================================================================
void My::CCardState::Uninit()
{
	//delete m_pCardCpy;
	//m_pCardCpy = nullptr;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardState::Copy(CCard* /*cpy*/)
{
	//m_pCardCpy = cpy;
}


//===========================================================================================================
// 
// ニュートラルステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStateNeutral::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStateNeutral::Update(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}


//===========================================================================================================
// 
// ピックアップステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStatePickup::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStatePickup::Update(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//===========================================================================================================
// 
// 選択ステート
// 
//===========================================================================================================

//=======================================================================================
// 初期化処理
//=======================================================================================
void My::CCardStateSelect::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}

//=======================================================================================
// 更新処理
//=======================================================================================
void My::CCardStateSelect::Update(CCard* cpy, CDuel_Player* /*duel*/)
{
	if (cpy == nullptr)
		return;
}


//===========================================================================================================
// 
// キャストステート(カードを使用)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateCast::Init(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	////リストの取得
	//std::list<CActiveSceneCharacter*> List = CActiveSceneManager::GetInstance()->GetCharacterList();

	////キャラクターの周回
	//for (auto& iter : List)
	//{
	//	if (cpy->GetUserArea() != iter->GetArea()) continue;

	// ステータスを取得
	//CActiveSceneCharacter::Status status = iter->GetStatus();

	// コスト分エナジーを減らす
	duel->GetStatus().energy -= cpy->GetBaseStatus().nCost;

	// エナジーを設定
	//iter->SetStatus(status);

	//	break;
	//}

	//カードのキャスト処理
	cpy->Cast(duel);
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateCast::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	//状態を変更
	ChangeToState(cpy, duel);

	//cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY, duel);

	//cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY);
}

//=======================================================================================
// 状態を変更
//=======================================================================================
void My::CCardStateCast::ChangeToState(CCard* cpy, CDuel_Player* duel)
{
	//守備カードじゃないならステイ状態
	if (cpy->GetBaseStatus().Maintype != CCard_Client::CardType::DEFENSE)
	{
		cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY, duel);
		return;
	}

	//ターゲットが自分なら守備待機状態へ
	if (cpy->GetCastDestination() == My::CCard::CastDestination::AREA)
	{
		cpy->ChangeState(CCardState::CARD_STATE::CARD_WAIT, duel);
		return;
	}

	//ターゲットが敵ならステイ状態へ
	cpy->ChangeState(CCardState::CARD_STATE::CARD_STAY, duel);
}

//===========================================================================================================
// 
// ステイステート(カード効果発動待機)
// 
//===========================================================================================================

//無名空間
namespace
{
	RakNet::Time TrrigerTime{ 3000 };	//トリガーするまでの経過時間
}

//=======================================================================================
//コンストラクタ
//=======================================================================================
My::CCardStateStay::CCardStateStay() : 
	m_fStaycount(0.0f)		//ステイ時間
{
	
}

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateStay::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	// カウントを初期化
	m_fStaycount = static_cast<float>(CDuel_Manager::GetInstance()->GetDuelTimer().GetElapsedTime() * 0.001f) - cpy->GetStartCastTime();
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateStay::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	//カウントをしないカードは飛ばす
	if (!cpy->IsStayCountDown())
	{
		return;
	}

	// カウントが設定された時間を超えたら
	if (m_fStaycount >= 3.0f)
	{
		// トリガー状態にする
		cpy->ChangeState(CCardState::CARD_STATE::CARD_TRIGGER, duel);

		return;
	}

	//時間の更新
	m_fStaycount += CDuel_Manager::GetInstance()->GetDuelTimer().GetdeltaTime() * 0.001f;
}

//===========================================================================================================
// 
// 守備ステイステート(守備カード効果発動待機)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateWait::Init(CCard* cpy, CDuel_Player* /*duel*/)
{
	
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateWait::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;
}

//===========================================================================================================
// 
// トリガーステート(カード効果発動)
// 
//===========================================================================================================

//=======================================================================================
// 初期化
//=======================================================================================
void My::CCardStateTrigger::Init(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;

	//リストの取得
	//std::list<CDuel_Player*> List = CDuel_Player_Manager::GetInstance()->GetList();
	CDuel_Player* UserPlayer = CDuel_Player_Manager::GetInstance()->GetDuelPlayer(cpy->GetUserId());

	//キャラクターの周回
	//for (auto& iter : List)
	//{
	//	if (cpy->GetUserArea() != iter->GetArea()) continue;

	//	//トリガーしたか
	//	if (CActiveSceneManager::GetInstance()->GetAreaManager()->CardTrigger(cpy->GetTarget()))
	//	{
	//		//トリガー処理
	//		//cpy->GetCardStrategy()->Strategy(duel, cpy);

	//		//TODO:一旦計算後のストラテジーベクターだけ処理
	//		std::vector<CCardStrategy_Base*> strategy_vector = cpy->GetPostCalculateVector();

	//		for (auto& itr : strategy_vector)
	//		{
	//			if (itr == nullptr) { continue; }
	//			itr->Strategy(duel, cpy);
	//		}
	//	}

	//	//// トリガーされた際に消去する(TODO : 使用者によって変更)
	//	//iter->GetTargetArrowManeger()->Remove();

	//	break;
	//}

	//トリガーしたか
	//if (CActiveSceneManager::GetInstance()->GetAreaManager()->CardTrigger(cpy->GetTarget()))
	{
		//トリガー処理
		//cpy->GetCardStrategy()->Strategy(duel, cpy);

		//TODO:一旦計算後のストラテジーベクターだけ処理
		std::vector<CCardStrategy_Base*> strategy_vector = cpy->GetPostCalculateVector();

		for (auto& itr : strategy_vector)
		{
			if (itr == nullptr) { continue; }
			itr->Strategy(duel, cpy);
		}
	}
}

//=======================================================================================
// 更新
//=======================================================================================
void My::CCardStateTrigger::Update(CCard* cpy, CDuel_Player* duel)
{
	if (cpy == nullptr)
		return;
}