//===========================================================================================================================================================
// 
// フィールドゾーン [field_zone.cpp]
// Author : Kasai Keisuke
// 
//===========================================================================================================================================================

// include 
#include "field_zone.h"

/**
* @brief コンストラクタ
*/
My::CFieldZone::CFieldZone()
{

}

/**
* @brief デストラクタ
*/
My::CFieldZone::~CFieldZone()
{

}

/**
* @brief カードを送る
*/
void My::CFieldZone::UseCardSend(CCard* pCard)
{
	// カードを追加
	AddList(pCard);
}
